const graphList = [
    [1, 2, "包含"],
    [1, 3, "包含"],
    [1, 4, "包含"],
    [1, 5, "包含"],
    [1, 6, "包含"],
    [1, 7, "包含"],
    [1, 8, "包含"],
    [1, 9, "包含"],
    [2, 10, "包含"],
    [2, 11, "包含"],
    [10, 12, "包含"],
    [10, 13, "包含"],
    [10, 14, "包含"],
    [10, 15, "包含"],
    [12, 16, "包含"],
    [12, 17, "包含"],
    [12, 18, "包含"],
    [12, 19, "包含"],
    [12, 20, "包含"],
    [13, 21, "包含"],
    [13, 22, "包含"],
    [13, 23, "包含"],
    [13, 24, "包含"],
    [13, 25, "包含"],
    [14, 26, "包含"],
    [14, 27, "包含"],
    [14, 28, "包含"],
    [14, 29, "包含"],
    [14, 30, "包含"],
    [15, 31, "包含"],
    [15, 32, "包含"],
    [15, 33, "包含"],
    [15, 34, "包含"],
    [15, 35, "包含"],
    [11, 36, "包含"],
    [11, 37, "包含"],
    [36, 38, "包含"],
    [36, 39, "包含"],
    [36, 40, "包含"],
    [36, 41, "包含"],
    [36, 42, "包含"],
    [36, 43, "包含"],
    [37, 44, "包含"],
    [37, 45, "包含"],
    [37, 46, "包含"],
    [37, 47, "包含"],
    [37, 48, "包含"],
    [37, 49, "包含"],
    [3, 50, "包含"],
    [3, 51, "包含"],
    [3, 52, "包含"],
    [3, 53, "包含"],
    [3, 54, "包含"],
    [51, 55, "包含"],
    [51, 56, "包含"],
    [51, 57, "包含"],
    [51, 58, "包含"],
    [51, 59, "包含"],
    [51, 60, "包含"],
    [51, 61, "包含"],
    [51, 62, "包含"],
    [4, 63, "包含"],
    [4, 64, "包含"],
    [4, 65, "包含"],
    [4, 66, "包含"],
    [4, 67, "包含"],
    [4, 68, "包含"],
    [4, 69, "包含"],
    [4, 70, "包含"],
    [63, 28, "包含"],
    [63, 30, "包含"],
    [5, 67, "包含"],
    [5, 68, "包含"],
    [5, 71, "包含"],
    [5, 72, "包含"],
    [5, 73, "包含"],
    [5, 74, "包含"],
    [5, 75, "包含"],
    [5, 76, "包含"],
    [73, 77, "包含"],
    [73, 78, "包含"],
    [73, 79, "包含"],
    [73, 80, "包含"],
    [75, 81, "包含"],
    [75, 82, "包含"],
    [75, 83, "包含"],
    [75, 84, "包含"],
    [75, 85, "包含"],
    [75, 86, "包含"],
    [75, 87, "包含"],
    [75, 88, "包含"],
    [75, 89, "包含"],
    [75, 90, "包含"],
    [75, 91, "包含"],
    [75, 92, "包含"],
    [75, 93, "包含"],
    [76, 30, "包含"],
    [76, 28, "包含"],
    [76, 94, "包含"],
    [76, 95, "包含"],
    [76, 96, "包含"],
    [6, 97, "包含"],
    [6, 98, "包含"],
    [6, 99, "包含"],
    [99, 100, "包含"],
    [99, 101, "包含"],
    [99, 102, "包含"],
    [7, 103, "包含"],
    [7, 104, "包含"],
    [7, 105, "包含"],
    [7, 106, "包含"],
    [7, 107, "包含"],
    [103, 108, "包含"],
    [103, 109, "包含"],
    [105, 110, "包含"],
    [105, 111, "包含"],
    [105, 112, "包含"],
    [105, 113, "包含"],
    [106, 114, "包含"],
    [106, 115, "包含"],
    [8, 116, "包含"],
    [8, 117, "包含"],
    [8, 118, "包含"],
    [117, 119, "包含"],
    [117, 120, "包含"],
    [118, 82, "包含"],
    [118, 84, "包含"],
    [118, 85, "包含"],
    [118, 86, "包含"],
    [118, 89, "包含"],
    [118, 90, "包含"],
    [118, 88, "包含"],
    [118, 121, "包含"],
    [118, 122, "包含"],
    [118, 123, "包含"],
    [118, 124, "包含"],
    [9, 125, "包含"],
    [9, 126, "包含"],
    [9, 127, "包含"],
    [9, 128, "包含"],
    [126, 129, "包含"],
    [127, 130, "包含"],
    [127, 131, "包含"],
    [127, 132, "包含"],
    [127, 133, "包含"],
    [127, 134, "包含"],
    [27, 59, "前导"],
    [26, 60, "前导"],
    [27, 55, "前导"],
    [26, 56, "前导"],
    [28, 63, "前导"],
    [30, 63, "前导"],
    [4, 76, "前导"],
    [13, 84, "前导"],
    [13, 85, "前导"],
    [13, 86, "前导"],
    [62, 88, "前导"],
    [135, 97, "前导"],
    [136, 98, "前导"],
    [76, 99, "前导"],
    [87, 99, "前导"],
    [137, 105, "前导"],
    [88, 106, "前导"],
    [7, 129, "前导"],
    [138, 53, "前导"],
    [72, 117, "前导"],
    [5, 8, "前导"],
    [3, 7, "前导"],
    [7, 9, "前导"],
    [27, 40, "前导"],
    [67, 108, "前导"],
    [68, 109, "前导"],
    [62, 139, "包含"],
    [62, 140, "包含"],
    [62, 141, "包含"],
    [139, 13, "前导"],
    [139, 26, "前导"],
    [139, 61, "前导"],
    [140, 26, "前导"],
    [140, 61, "前导"],
    [141, 61, "前导"],
    [141, 58, "前导"],
    [141, 59, "前导"],
    [141, 60, "前导"],
    [142, 108, "前导"],
    [142, 109, "前导"],
    [142, 150, "前导"],
    [142, 110, "前导"],
    [142, 111, "前导"],
    [142, 112, "前导"],
    [143, 114, "前导"],
    [143, 87, "前导"],
    [144, 115, "前导"],
    [144, 87, "前导"],
    [144, 110, "前导"],
    [145, 146, "前导"],
    [145, 147, "前导"],
    [145, 151, "前导"],
    [145, 152, "前导"],
    [146, 153, "前导"],
    [146, 41, "前导"],
    [146, 5, "前导"],
    [147, 89, "前导"],
    [147, 90, "前导"],
    [147, 42, "前导"],
    [147, 148, "前导"],
    [147, 149, "前导"],
    [147, 8, "前导"],
    [148, 138, "前导"],
    [148, 89, "前导"],
    [148, 8, "前导"],
    [149, 42, "前导"],
    [149, 8, "前导"],
    [129, 108, "前导"],
    [129, 109, "前导"]
];

const graphNameList = {
    1: { name: "信号与系统", type: "知识点" },
    2: { name: "基本概念", type: "知识点" },
    3: { name: "线性系统时域分析", type: "知识点" },
    4: { name: "周期信号傅里叶级数", type: "知识点" },
    5: { name: "傅里叶变换", type: "知识点" },
    6: { name: "抽样", type: "知识点" },
    7: { name: "线性系统频域分析", type: "知识点" },
    8: { name: "拉普拉斯变换", type: "知识点" },
    9: { name: "线性系统复频域分析", type: "知识点" },
    10: { name: "信号", type: "知识点" },
    11: { name: "系统", type: "知识点" },
    12: { name: "信号分类", type: "知识点" },
    13: { name: "信号基本运算", type: "知识点" },
    14: { name: "基本信号", type: "知识点" },
    15: { name: "信号分解", type: "知识点" },
    16: { name: "连续性分类", type: "知识点" },
    17: { name: "周期性分类", type: "知识点" },
    18: { name: "虚实分类", type: "知识点" },
    19: { name: "能量功率分类", type: "知识点" },
    20: { name: "确定性分类", type: "知识点" },
    21: { name: "加法", type: "知识点" },
    22: { name: "乘法", type: "知识点" },
    23: { name: "反转", type: "知识点" },
    24: { name: "平移", type: "知识点" },
    25: { name: "尺度变换", type: "知识点" },
    26: { name: "阶跃信号", type: "知识点" },
    27: { name: "冲激信号", type: "知识点" },
    28: { name: "三角信号", type: "知识点" },
    29: { name: "实指数信号", type: "知识点" },
    30: { name: "复指数信号", type: "知识点" },
    31: { name: "直流交流分解", type: "知识点" },
    32: { name: "偶奇分解", type: "知识点" },
    33: { name: "实虚分解", type: "知识点" },
    34: { name: "正交分解", type: "知识点" },
    35: { name: "脉冲分解", type: "知识点" },
    36: { name: "系统表示", type: "知识点" },
    37: { name: "系统特性", type: "知识点" },
    38: { name: "数学模型（微分方程）", type: "知识点" },
    39: { name: "框图", type: "知识点" },
    40: { name: "时域系统函数", type: "知识点" },
    41: { name: "频域域系统函数", type: "知识点" },
    42: { name: "复频域系统函数", type: "知识点" },
    43: { name: "信号流图", type: "知识点" },
    44: { name: "线性", type: "知识点" },
    45: { name: "时不变性", type: "知识点" },
    46: { name: "因果性", type: "知识点" },
    47: { name: "稳定性", type: "知识点" },
    48: { name: "记忆性", type: "知识点" },
    49: { name: "可逆性", type: "知识点" },
    50: { name: "零输入响应", type: "知识点" },
    51: { name: "零状态响应", type: "知识点" },
    52: { name: "强迫响应", type: "知识点" },
    53: { name: "自由响应", type: "知识点" },
    54: { name: "全响应", type: "知识点" },
    55: { name: "冲激响应", type: "知识点" },
    56: { name: "阶跃响应", type: "知识点" },
    57: { name: "卷积代数性质", type: "知识点" },
    58: { name: "卷积计算性质", type: "知识点" },
    59: { name: "与冲激信号及其各阶导数卷积", type: "知识点" },
    60: { name: "与阶跃信号卷积", type: "知识点" },
    61: { name: "卷积计算公式", type: "知识点" },
    62: { name: "卷积计算方法", type: "知识点" },
    63: { name: "周期信号分解", type: "知识点" },
    64: { name: "频谱离散性", type: "知识点" },
    65: { name: "频谱谐波性", type: "知识点" },
    66: { name: "频谱收敛性", type: "知识点" },
    67: { name: "幅度频谱", type: "知识点" },
    68: { name: "相位频谱", type: "知识点" },
    69: { name: "周期信号对称性与级数关系", type: "知识点" },
    70: { name: "周期矩形脉冲频谱", type: "知识点" },
    71: { name: "频谱密度函数", type: "知识点" },
    72: { name: "傅里叶变换存在条件", type: "知识点" },
    73: { name: "常用傅里叶变换", type: "知识点" },
    74: { name: "频率分量分析", type: "分析方法" },
    75: { name: "傅里叶变换性质", type: "知识点" },
    76: { name: "周期信号傅里叶变换", type: "知识点" },
    77: { name: "直流信号傅里叶变换", type: "知识点" },
    78: { name: "单边指数信号傅里叶变换", type: "知识点" },
    79: { name: "矩形信号傅里叶变换", type: "知识点" },
    80: { name: "符号函数傅里叶变换", type: "知识点" },
    81: { name: "奇偶虚实性", type: "知识点" },
    82: { name: "线性", type: "知识点" },
    83: { name: "对偶性", type: "知识点" },
    84: { name: "尺度变换", type: "知识点" },
    85: { name: "时移特性", type: "知识点" },
    86: { name: "频移特性", type: "知识点" },
    87: { name: "相乘定理", type: "知识点" },
    88: { name: "卷积定理", type: "知识点" },
    89: { name: "时域微分", type: "知识点" },
    90: { name: "时域积分", type: "知识点" },
    91: { name: "频域微分", type: "知识点" },
    92: { name: "频域积分", type: "知识点" },
    93: { name: "帕斯瓦尔定理", type: "知识点" },
    94: { name: "冲激串信号", type: "知识点" },
    95: { name: "周期脉冲信号", type: "知识点" },
    96: { name: "冲激信号组成频谱", type: "知识点" },
    97: { name: "理想抽样", type: "知识点" },
    98: { name: "矩形脉冲抽样", type: "知识点" },
    99: { name: "抽样定理", type: "知识点" },
    100: { name: "奈奎斯特抽样频率", type: "知识点" },
    101: { name: "奈奎斯特抽样间隔", type: "知识点" },
    102: { name: "被抽样信号频率受限", type: "知识点" },
    103: { name: "频域系统函数", type: "知识点" },
    104: { name: "无失真系统", type: "知识点" },
    105: { name: "滤波器", type: "知识点" },
    106: { name: "通信系统", type: "知识点" },
    107: { name: "电路系统频域分析", type: "分析方法" },
    108: { name: "幅频特性", type: "知识点" },
    109: { name: "相频特性", type: "知识点" },
    110: { name: "低通滤波器", type: "知识点" },
    111: { name: "高通滤波器", type: "知识点" },
    112: { name: "带通滤波器", type: "知识点" },
    113: { name: "带阻滤波器", type: "知识点" },
    114: { name: "调制", type: "知识点" },
    115: { name: "解调", type: "知识点" },
    116: { name: "单边变换", type: "知识点" },
    117: { name: "收敛域", type: "知识点" },
    118: { name: "拉普拉斯变换性质", type: "知识点" },
    119: { name: "左边信号", type: "知识点" },
    120: { name: "右边信号", type: "知识点" },
    121: { name: "s域微分", type: "知识点" },
    122: { name: "s域积分", type: "知识点" },
    123: { name: "初值定理", type: "知识点" },
    124: { name: "终值定理", type: "知识点" },
    125: { name: "电路复频域域分析", type: "分析方法" },
    126: { name: "零极点矢量", type: "知识点" },
    127: { name: "零极点", type: "知识点" },
    128: { name: "零状态响应求解方法", type: "分析方法" },
    129: { name: "频谱分析", type: "分析方法" },
    130: { name: "极点与自由响应关系", type: "知识点" },
    131: { name: "极点与系统稳定性关系", type: "知识点" },
    132: { name: "极点与系统特征频率关系", type: "知识点" },
    133: { name: "全通系统零极点分布", type: "知识点" },
    134: { name: "最小相移系统零极点分布", type: "知识点" },
    135: { name: "冲激串信号傅里叶变换", type: "知识点" },
    136: { name: "周期脉冲信号傅里叶变换", type: "知识点" },
    137: { name: "电路系统", type: "知识点" },
    138: { name: "系统特征频率", type: "知识点" },
    139: { name: "卷积图解法", type: "分析方法" },
    140: { name: "卷积解析法", type: "分析方法" },
    141: { name: "卷积性质法", type: "分析方法" },
    142: { name: "滤波器设计方法", type: "分析方法" },
    143: { name: "调制方法", type: "分析方法" },
    144: { name: "解调方法", type: "分析方法" },
    145: { name: "电路系统分析方法", type: "分析方法" },
    146: { name: "电路系统频域分析", type: "分析方法" },
    147: { name: "电路系统复频域分析", type: "分析方法" },
    148: { name: "零输入响应求解方法", type: "分析方法" },
    149: { name: "零状态响应求解方法", type: "分析方法" },
    150: { name: "通频带", type: "知识点" },
    151: { name: "RC电路", type: "知识点" },
    152: { name: "RL电路", type: "知识点" },
    153: { name: "相量分析法", type: "分析方法" }
};

// 这是已经处理后的数据
const fullData = {
    "1": {
        "包含": [
            2,
            3,
            4,
            5,
            6,
            7,
            8,
            9
        ]
    },
    "2": {
        "前导": [
            1
        ],
        "包含": [
            10,
            11
        ]
    },
    "3": {
        "前导": [
            1,
            7
        ],
        "包含": [
            50,
            51,
            52,
            53,
            54
        ]
    },
    "4": {
        "前导": [
            1,
            76
        ],
        "包含": [
            63,
            64,
            65,
            66,
            67,
            68,
            69,
            70
        ]
    },
    "5": {
        "前导": [
            1,
            8
        ],
        "包含": [
            67,
            68,
            71,
            72,
            73,
            74,
            75,
            76,
            146
        ]
    },
    "6": {
        "前导": [
            1
        ],
        "包含": [
            97,
            98,
            99
        ]
    },
    "7": {
        "前导": [
            1,
            129,
            9
        ],
        "包含": [
            103,
            104,
            105,
            106,
            107,
            3
        ]
    },
    "8": {
        "前导": [
            1
        ],
        "包含": [
            116,
            117,
            118,
            5,
            147,
            148,
            149
        ]
    },
    "9": {
        "前导": [
            1
        ],
        "包含": [
            125,
            126,
            127,
            128,
            7
        ]
    },
    "10": {
        "前导": [
            2
        ],
        "包含": [
            12,
            13,
            14,
            15
        ]
    },
    "11": {
        "前导": [
            2
        ],
        "包含": [
            36,
            37
        ]
    },
    "12": {
        "前导": [
            10
        ],
        "包含": [
            16,
            17,
            18,
            19,
            20
        ]
    },
    "13": {
        "前导": [
            10,
            84,
            85,
            86
        ],
        "包含": [
            21,
            22,
            23,
            24,
            25,
            139
        ]
    },
    "14": {
        "前导": [
            10
        ],
        "包含": [
            26,
            27,
            28,
            29,
            30
        ]
    },
    "15": {
        "前导": [
            10
        ],
        "包含": [
            31,
            32,
            33,
            34,
            35
        ]
    },
    "16": {
        "前导": [
            12
        ]
    },
    "17": {
        "前导": [
            12
        ]
    },
    "18": {
        "前导": [
            12
        ]
    },
    "19": {
        "前导": [
            12
        ]
    },
    "20": {
        "前导": [
            12
        ]
    },
    "21": {
        "前导": [
            13
        ]
    },
    "22": {
        "前导": [
            13
        ]
    },
    "23": {
        "前导": [
            13
        ]
    },
    "24": {
        "前导": [
            13
        ]
    },
    "25": {
        "前导": [
            13
        ]
    },
    "26": {
        "前导": [
            14,
            60,
            56
        ],
        "包含": [
            139,
            140
        ]
    },
    "27": {
        "前导": [
            14,
            59,
            55,
            40
        ]
    },
    "28": {
        "前导": [
            14,
            63,
            76
        ]
    },
    "29": {
        "前导": [
            14
        ]
    },
    "30": {
        "前导": [
            14,
            63,
            76
        ]
    },
    "31": {
        "前导": [
            15
        ]
    },
    "32": {
        "前导": [
            15
        ]
    },
    "33": {
        "前导": [
            15
        ]
    },
    "34": {
        "前导": [
            15
        ]
    },
    "35": {
        "前导": [
            15
        ]
    },
    "36": {
        "前导": [
            11
        ],
        "包含": [
            38,
            39,
            40,
            41,
            42,
            43
        ]
    },
    "37": {
        "前导": [
            11
        ],
        "包含": [
            44,
            45,
            46,
            47,
            48,
            49
        ]
    },
    "38": {
        "前导": [
            36
        ]
    },
    "39": {
        "前导": [
            36
        ]
    },
    "40": {
        "前导": [
            36
        ],
        "包含": [
            27
        ]
    },
    "41": {
        "前导": [
            36
        ],
        "包含": [
            146
        ]
    },
    "42": {
        "前导": [
            36
        ],
        "包含": [
            147,
            149
        ]
    },
    "43": {
        "前导": [
            36
        ]
    },
    "44": {
        "前导": [
            37
        ]
    },
    "45": {
        "前导": [
            37
        ]
    },
    "46": {
        "前导": [
            37
        ]
    },
    "47": {
        "前导": [
            37
        ]
    },
    "48": {
        "前导": [
            37
        ]
    },
    "49": {
        "前导": [
            37
        ]
    },
    "50": {
        "前导": [
            3
        ]
    },
    "51": {
        "前导": [
            3
        ],
        "包含": [
            55,
            56,
            57,
            58,
            59,
            60,
            61,
            62
        ]
    },
    "52": {
        "前导": [
            3
        ]
    },
    "53": {
        "前导": [
            3
        ],
        "包含": [
            138
        ]
    },
    "54": {
        "前导": [
            3
        ]
    },
    "55": {
        "前导": [
            51
        ],
        "包含": [
            27
        ]
    },
    "56": {
        "前导": [
            51
        ],
        "包含": [
            26
        ]
    },
    "57": {
        "前导": [
            51
        ]
    },
    "58": {
        "前导": [
            51
        ],
        "包含": [
            141
        ]
    },
    "59": {
        "前导": [
            51
        ],
        "包含": [
            27,
            141
        ]
    },
    "60": {
        "前导": [
            51
        ],
        "包含": [
            26,
            141
        ]
    },
    "61": {
        "前导": [
            51
        ],
        "包含": [
            139,
            140,
            141
        ]
    },
    "62": {
        "前导": [
            51,
            88
        ],
        "包含": [
            139,
            140,
            141
        ]
    },
    "63": {
        "前导": [
            4
        ],
        "包含": [
            28,
            30
        ]
    },
    "64": {
        "前导": [
            4
        ]
    },
    "65": {
        "前导": [
            4
        ]
    },
    "66": {
        "前导": [
            4
        ]
    },
    "67": {
        "前导": [
            4,
            5,
            108
        ]
    },
    "68": {
        "前导": [
            4,
            5,
            109
        ]
    },
    "69": {
        "前导": [
            4
        ]
    },
    "70": {
        "前导": [
            4
        ]
    },
    "71": {
        "前导": [
            5
        ]
    },
    "72": {
        "前导": [
            5,
            117
        ]
    },
    "73": {
        "前导": [
            5
        ],
        "包含": [
            77,
            78,
            79,
            80
        ]
    },
    "74": {
        "前导": [
            5
        ]
    },
    "75": {
        "前导": [
            5
        ],
        "包含": [
            81,
            82,
            83,
            84,
            85,
            86,
            87,
            88,
            89,
            90,
            91,
            92,
            93
        ]
    },
    "76": {
        "前导": [
            5,
            99
        ],
        "包含": [
            30,
            28,
            94,
            95,
            96,
            4
        ]
    },
    "77": {
        "前导": [
            73
        ]
    },
    "78": {
        "前导": [
            73
        ]
    },
    "79": {
        "前导": [
            73
        ]
    },
    "80": {
        "前导": [
            73
        ]
    },
    "81": {
        "前导": [
            75
        ]
    },
    "82": {
        "前导": [
            75,
            118
        ]
    },
    "83": {
        "前导": [
            75
        ]
    },
    "84": {
        "前导": [
            75,
            118
        ],
        "包含": [
            13
        ]
    },
    "85": {
        "前导": [
            75,
            118
        ],
        "包含": [
            13
        ]
    },
    "86": {
        "前导": [
            75,
            118
        ],
        "包含": [
            13
        ]
    },
    "87": {
        "前导": [
            75,
            99
        ],
        "包含": [
            143,
            144
        ]
    },
    "88": {
        "前导": [
            75,
            118,
            106
        ],
        "包含": [
            62
        ]
    },
    "89": {
        "前导": [
            75,
            118
        ],
        "包含": [
            147,
            148
        ]
    },
    "90": {
        "前导": [
            75,
            118
        ],
        "包含": [
            147
        ]
    },
    "91": {
        "前导": [
            75
        ]
    },
    "92": {
        "前导": [
            75
        ]
    },
    "93": {
        "前导": [
            75
        ]
    },
    "94": {
        "前导": [
            76
        ]
    },
    "95": {
        "前导": [
            76
        ]
    },
    "96": {
        "前导": [
            76
        ]
    },
    "97": {
        "前导": [
            6
        ],
        "包含": [
            135
        ]
    },
    "98": {
        "前导": [
            6
        ],
        "包含": [
            136
        ]
    },
    "99": {
        "前导": [
            6
        ],
        "包含": [
            100,
            101,
            102,
            76,
            87
        ]
    },
    "100": {
        "前导": [
            99
        ]
    },
    "101": {
        "前导": [
            99
        ]
    },
    "102": {
        "前导": [
            99
        ]
    },
    "103": {
        "前导": [
            7
        ],
        "包含": [
            108,
            109
        ]
    },
    "104": {
        "前导": [
            7
        ]
    },
    "105": {
        "前导": [
            7
        ],
        "包含": [
            110,
            111,
            112,
            113,
            137
        ]
    },
    "106": {
        "前导": [
            7
        ],
        "包含": [
            114,
            115,
            88
        ]
    },
    "107": {
        "前导": [
            7
        ]
    },
    "108": {
        "前导": [
            103
        ],
        "包含": [
            67,
            142,
            129
        ]
    },
    "109": {
        "前导": [
            103
        ],
        "包含": [
            68,
            142,
            129
        ]
    },
    "110": {
        "前导": [
            105
        ],
        "包含": [
            142,
            144
        ]
    },
    "111": {
        "前导": [
            105
        ],
        "包含": [
            142
        ]
    },
    "112": {
        "前导": [
            105
        ],
        "包含": [
            142
        ]
    },
    "113": {
        "前导": [
            105
        ]
    },
    "114": {
        "前导": [
            106
        ],
        "包含": [
            143
        ]
    },
    "115": {
        "前导": [
            106
        ],
        "包含": [
            144
        ]
    },
    "116": {
        "前导": [
            8
        ]
    },
    "117": {
        "前导": [
            8
        ],
        "包含": [
            119,
            120,
            72
        ]
    },
    "118": {
        "前导": [
            8
        ],
        "包含": [
            82,
            84,
            85,
            86,
            89,
            90,
            88,
            121,
            122,
            123,
            124
        ]
    },
    "119": {
        "前导": [
            117
        ]
    },
    "120": {
        "前导": [
            117
        ]
    },
    "121": {
        "前导": [
            118
        ]
    },
    "122": {
        "前导": [
            118
        ]
    },
    "123": {
        "前导": [
            118
        ]
    },
    "124": {
        "前导": [
            118
        ]
    },
    "125": {
        "前导": [
            9
        ]
    },
    "126": {
        "前导": [
            9
        ],
        "包含": [
            129
        ]
    },
    "127": {
        "前导": [
            9
        ],
        "包含": [
            130,
            131,
            132,
            133,
            134
        ]
    },
    "128": {
        "前导": [
            9
        ]
    },
    "129": {
        "前导": [
            126,
            108,
            109
        ],
        "包含": [
            7
        ]
    },
    "130": {
        "前导": [
            127
        ]
    },
    "131": {
        "前导": [
            127
        ]
    },
    "132": {
        "前导": [
            127
        ]
    },
    "133": {
        "前导": [
            127
        ]
    },
    "134": {
        "前导": [
            127
        ]
    },
    "135": {
        "前导": [
            97
        ]
    },
    "136": {
        "前导": [
            98
        ]
    },
    "137": {
        "前导": [
            105
        ]
    },
    "138": {
        "前导": [
            53
        ],
        "包含": [
            148
        ]
    },
    "139": {
        "前导": [
            62,
            13,
            26,
            61
        ]
    },
    "140": {
        "前导": [
            62,
            26,
            61
        ]
    },
    "141": {
        "前导": [
            62,
            61,
            58,
            59,
            60
        ]
    },
    "142": {
        "前导": [
            108,
            109,
            150,
            110,
            111,
            112
        ]
    },
    "143": {
        "前导": [
            114,
            87
        ]
    },
    "144": {
        "前导": [
            115,
            87,
            110
        ]
    },
    "145": {
        "前导": [
            146,
            147,
            151,
            152
        ]
    },
    "146": {
        "包含": [
            145
        ],
        "前导": [
            153,
            41,
            5
        ]
    },
    "147": {
        "包含": [
            145
        ],
        "前导": [
            89,
            90,
            42,
            148,
            149,
            8
        ]
    },
    "148": {
        "包含": [
            147
        ],
        "前导": [
            138,
            89,
            8
        ]
    },
    "149": {
        "包含": [
            147
        ],
        "前导": [
            42,
            8
        ]
    },
    "150": {
        "包含": [
            142
        ]
    },
    "151": {
        "包含": [
            145
        ]
    },
    "152": {
        "包含": [
            145
        ]
    },
    "153": {
        "包含": [
            146
        ]
    }
}

// 这是处理后可以发给阿里云的数据
const aliyunData = [{
    id: '信号与系统',
    content: '知识点名称：信号与系统。类型：知识点。它包含的子知识点有: 基本概念、线性系统时域分析、周期信号傅里叶级数、傅里叶变换、抽样、线性系统频域分析、拉普拉斯变换、线性系统复频域分析。它的 前导知识点有: '
},
{
    id: '基本概念',
    content: '知识点名称：基本概念。类型：知识点。它包含的子知识点有: 信号、系统。它的前导知识点有: 信号与系统'
},
{
    id: '线性系统时域分析',
    content: '知识点名称：线性系统时域分析。类型：知识点。它包含的子知识点有: 零输入响应、零状态响应、强迫响应、自由响应、全响应。它的前导知识点有: 信号与系统、线性系统频域分析'
},
{
    id: '周期信号傅里叶级数',
    content: '知识点名称：周期信号傅里叶级数。类型：知识点。它包含的子知识点有: 周期信号分解、频谱离散性、频谱谐波性、频谱收敛性、幅度频谱、相位频谱、周期信号对称性与级数关系、周期矩形脉冲频谱。 它的前导知识点有: 信号与系统、周期信号傅里叶变换'
},
{
    id: '傅里叶变换',
    content: '知识点名称：傅里叶变换。类型：知识点。它包含的子知识点有: 幅度频谱、相位频谱、频谱密度函数、傅里叶变换存在条件、常用傅里叶变换、频率分量分析、傅里叶变换性质、周期信号傅里叶变换、电 路系统频域分析。它的前导知识点有: 信号与系统、拉普拉斯变换'
},
{
    id: '抽样',
    content: '知识点名称：抽样。类型：知识点。它包含的子知识点有: 理想抽样、矩形脉冲抽样、抽样定理。它的前导知识点有: 信号与系统'
},
{
    id: '线性系统频域分析',
    content: '知识点名称：线性系统频域分析。类型：知识点。它包含的子知识点有: 频域系统函数、无失真系统、滤波器、通信系统、电路系统频域分析、线性系统时域分析。它的前导知识点有: 信号与系统、频谱分 析、线性系统复频域分析'
},  
{   
    id: '拉普拉斯变换',
    content: '知识点名称：拉普拉斯变换。类型：知识点。它包含的子知识点有: 单边变换、收敛域、拉普拉斯变换性质、傅里叶变换、电路系统复频域分析、零输入响应求解方法、零状态响应求解方法。它的前导知识 点有: 信号与系统'
},
{
    id: '线性系统复频域分析',
    content: '知识点名称：线性系统复频域分析。类型：知识点。它包含的子知识点有: 电路复频域域分析、零极点矢量、零极点、零状态响应求解方法、线性系统频域分析。它的前导知识点有: 信号与系统'
},
{
    id: '信号',
    content: '知识点名称：信号。类型：知识点。它包含的子知识点有: 信号分类、信号基本运算、基本信号、信号分解。它的前导知识点有: 基本概念'
},
{
    id: '系统',
    content: '知识点名称：系统。类型：知识点。它包含的子知识点有: 系统表示、系统特性。它的前导知识点有: 基本概念'
},
{
    id: '信号分类',
    content: '知识点名称：信号分类。类型：知识点。它包含的子知识点有: 连续性分类、周期性分类、虚实分类、能量功率分类、确定性分类。它的前导知识点有: 信号'
},
{
    id: '信号基本运算',
    content: '知识点名称：信号基本运算。类型：知识点。它包含的子知识点有: 加法、乘法、反转、平移、尺度变换、卷积图解法。它的前导知识点有: 信号、尺度变换、时移特性、频移特性'
},
{
    id: '基本信号',
    content: '知识点名称：基本信号。类型：知识点。它包含的子知识点有: 阶跃信号、冲激信号、三角信号、实指数信号、复指数信号。它的前导知识点有: 信号'
},
{
    id: '信号分解',
    content: '知识点名称：信号分解。类型：知识点。它包含的子知识点有: 直流交流分解、偶奇分解、实虚分解、正交分解、脉冲分解。它的前导知识点有: 信号'
},
{
    id: '连续性分类',
    content: '知识点名称：连续性分类。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分类'
},
{
    id: '周期性分类',
    content: '知识点名称：周期性分类。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分类'
},
{ id: '虚实分类', content: '知识点名称：虚实分类。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分类' },
{
    id: '能量功率分类',
    content: '知识点名称：能量功率分类。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分类'
},
{
    id: '确定性分类',
    content: '知识点名称：确定性分类。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分类'
},
{ id: '加法', content: '知识点名称：加法。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号基本运算' },
{ id: '乘法', content: '知识点名称：乘法。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号基本运算' },
{ id: '反转', content: '知识点名称：反转。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号基本运算' },
{ id: '平移', content: '知识点名称：平移。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号基本运算' },
{
    id: '尺度变换',
    content: '知识点名称：尺度变换。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号基本运算'
},
{
    id: '阶跃信号',
    content: '知识点名称：阶跃信号。类型：知识点。它包含的子知识点有: 卷积图解法、卷积解析法。它的前导知识点有: 基本信号、与阶跃信号卷积、阶跃响应'
},
{
    id: '冲激信号',
    content: '知识点名称：冲激信号。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 基本信号、与冲激信号及其各阶导数卷积、冲激响应、时域系统函数'
},
{
    id: '三角信号',
    content: '知识点名称：三角信号。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 基本信号、周期信号分解、周期信号傅里叶变换'
},
{
    id: '实指数信号',
    content: '知识点名称：实指数信号。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 基本信号'
},
{
    id: '复指数信号',
    content: '知识点名称：复指数信号。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 基本信号、周期信号分解、周期信号傅里叶变换'
},
{
    id: '直流交流分解',
    content: '知识点名称：直流交流分解。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分解'
},
{ id: '偶奇分解', content: '知识点名称：偶奇分解。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分解' },
{ id: '实虚分解', content: '知识点名称：实虚分解。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分解' },
{ id: '正交分解', content: '知识点名称：正交分解。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分解' },
{ id: '脉冲分解', content: '知识点名称：脉冲分解。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 信号分解' },
{
    id: '系统表示',
    content: '知识点名称：系统表示。类型：知识点。它包含的子知识点有: 数学模型（微分方程）、框图、时域系统函数、频域域系统函数、复频域系统函数、信号流图。它的前导知识点有: 系统'
},
{
    id: '系统特性',
    content: '知识点名称：系统特性。类型：知识点。它包含的子知识点有: 线性、时不变性、因果性、稳定性、记忆性、可逆性。它的前导知识点有: 系统'
},
{
    id: '数学模型（微分方程）',
    content: '知识点名称：数学模型（微分方程）。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统表示'
},
{ id: '框图', content: '知识点名称：框图。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统表示' },
{
    id: '时域系统函数',
    content: '知识点名称：时域系统函数。类型：知识点。它包含的子知识点有: 冲激信号。它的前导知识点有: 系统表示'
},
{
    id: '频域域系统函数',
    content: '知识点名称：频域域系统函数。类型：知识点。它包含的子知识点有: 电路系统频域分析。它的前导知识点有: 系统表示'
},
{
    id: '复频域系统函数',
    content: '知识点名称：复频域系统函数。类型：知识点。它包含的子知识点有: 电路系统复频域分析、零状态响应求解方法。它的前导知识点有: 系统表示'
},
{ id: '信号流图', content: '知识点名称：信号流图。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统表示' },
{ id: '线性', content: '知识点名称：线性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统特性' },
{ id: '时不变性', content: '知识点名称：时不变性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统特性' },
{ id: '因果性', content: '知识点名称：因果性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统特性' },
{ id: '稳定性', content: '知识点名称：稳定性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统特性' },
{ id: '记忆性', content: '知识点名称：记忆性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统特性' },
{ id: '可逆性', content: '知识点名称：可逆性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 系统特性' },
{
    id: '零输入响应',
    content: '知识点名称：零输入响应。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 线性系统时域分析'
},
{
    id: '零状态响应',
    content: '知识点名称：零状态响应。类型：知识点。它包含的子知识点有: 冲激响应、阶跃响应、卷积代数性质、卷积计算性质、与冲激信号及其各阶导数卷积、与阶跃信号卷积、卷积计算公式、卷积计算方法。它 的前导知识点有: 线性系统时域分析'
},
{
    id: '强迫响应',
    content: '知识点名称：强迫响应。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 线性系统时域分析'
},
{
    id: '自由响应',
    content: '知识点名称：自由响应。类型：知识点。它包含的子知识点有: 系统特征频率。它的前导知识点有: 线性系统时域分析'
},
{
    id: '全响应',
    content: '知识点名称：全响应。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 线性系统时域分析'
},
{
    id: '冲激响应',
    content: '知识点名称：冲激响应。类型：知识点。它包含的子知识点有: 冲激信号。它的前导知识点有: 零状态响应'
},
{
    id: '阶跃响应',
    content: '知识点名称：阶跃响应。类型：知识点。它包含的子知识点有: 阶跃信号。它的前导知识点有: 零状态响应'
},
{
    id: '卷积代数性质',
    content: '知识点名称：卷积代数性质。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 零状态响应'
},
{
    id: '卷积计算性质',
    content: '知识点名称：卷积计算性质。类型：知识点。它包含的子知识点有: 卷积性质法。它的前导知识点有: 零状态响应'
},
{
    id: '与冲激信号及其各阶导数卷积',
    content: '知识点名称：与冲激信号及其各阶导数卷积。类型：知识点。它包含的子知识点有: 冲激信号、卷积性质法。它的前导知识点有: 零状态响应'
},
{
    id: '与阶跃信号卷积',
    content: '知识点名称：与阶跃信号卷积。类型：知识点。它包含的子知识点有: 阶跃信号、卷积性质法。它的前导知识点有: 零状态响应'
},
{
    id: '卷积计算公式',
    content: '知识点名称：卷积计算公式。类型：知识点。它包含的子知识点有: 卷积图解法、卷积解析法、卷积性质法。它的前导知识点有: 零状态响应'
},
{
    id: '卷积计算方法',
    content: '知识点名称：卷积计算方法。类型：知识点。它包含的子知识点有: 卷积图解法、卷积解析法、卷积性质法。它的前导知识点有: 零状态响应、卷积定理'
},
{
    id: '周期信号分解',
    content: '知识点名称：周期信号分解。类型：知识点。它包含的子知识点有: 三角信号、复指数信号。它的前导知识点有: 周期信号傅里叶级数'
},
{
    id: '频谱离散性',
    content: '知识点名称：频谱离散性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶级数'
},
{
    id: '频谱谐波性',
    content: '知识点名称：频谱谐波性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶级数'
},
{
    id: '频谱收敛性',
    content: '知识点名称：频谱收敛性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶级数'
},
{
    id: '幅度频谱',
    content: '知识点名称：幅度频谱。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶级数、傅里叶变换、幅频特性'
},
{
    id: '相位频谱',
    content: '知识点名称：相位频谱。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶级数、傅里叶变换、相频特性'
},
{
    id: '周期信号对称性与级数关系',
    content: '知识点名称：周期信号对称性与级数关系。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶级数'
},
{
    id: '周期矩形脉冲频谱',
    content: '知识点名称：周期矩形脉冲频谱。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶级数'
},
{
    id: '频谱密度函数',
    content: '知识点名称：频谱密度函数。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换'
},
{
    id: '傅里叶变换存在条件',
    content: '知识点名称：傅里叶变换存在条件。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换、收敛域'
},
{
    id: '常用傅里叶变换',
    content: '知识点名称：常用傅里叶变换。类型：知识点。它包含的子知识点有: 直流信号傅里叶变换、单边指数信号傅里叶变换、矩形信号傅里叶变换、符号函数傅里叶变换。它的前导知识点有: 傅里叶变换'
},
{
    id: '频率分量分析',
    content: '知识点名称：频率分量分析。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换'
},
{
    id: '傅里叶变换性质',
    content: '知识点名称：傅里叶变换性质。类型：知识点。它包含的子知识点有: 奇偶虚实性、线性、对偶性、尺度变换、时移特性、频移特性、相乘定理、卷积定理、时域微分、时域积分、频域微分、频域积分、帕 斯瓦尔定理。它的前导知识点有: 傅里叶变换'
},
{
    id: '周期信号傅里叶变换',
    content: '知识点名称：周期信号傅里叶变换。类型：知识点。它包含的子知识点有: 复指数信号、三角信号、冲激串信号、周期脉冲信号、冲激信号组成频谱、周期信号傅里叶级数。它的前导知识点有: 傅里叶变换 、抽样定理'
},
{
    id: '直流信号傅里叶变换',
    content: '知识点名称：直流信号傅里叶变换。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 常用傅里叶变换'
},
{
    id: '单边指数信号傅里叶变换',
    content: '知识点名称：单边指数信号傅里叶变换。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 常用傅里叶变换'
},
{
    id: '矩形信号傅里叶变换',
    content: '知识点名称：矩形信号傅里叶变换。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 常用傅里叶变换'
},
{
    id: '符号函数傅里叶变换',
    content: '知识点名称：符号函数傅里叶变换。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 常用傅里叶变换'
},
{
    id: '奇偶虚实性',
    content: '知识点名称：奇偶虚实性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换性质'
},
{
    id: '线性',
    content: '知识点名称：线性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换性质、拉普拉斯变换性质'
},
{
    id: '对偶性',
    content: '知识点名称：对偶性。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换性质'
},
{
    id: '尺度变换',
    content: '知识点名称：尺度变换。类型：知识点。它包含的子知识点有: 信号基本运算。它的前导知识点有: 傅里叶变换性质、拉普拉斯变换性质'
},
{
    id: '时移特性',
    content: '知识点名称：时移特性。类型：知识点。它包含的子知识点有: 信号基本运算。它的前导知识点有: 傅里叶变换性质、拉普拉斯变换性质'
},
{
    id: '频移特性',
    content: '知识点名称：频移特性。类型：知识点。它包含的子知识点有: 信号基本运算。它的前导知识点有: 傅里叶变换性质、拉普拉斯变换性质'
},
{
    id: '相乘定理',
    content: '知识点名称：相乘定理。类型：知识点。它包含的子知识点有: 调制方法、解调方法。它的前导知识点有: 傅里叶变换性质、抽样定理'
},
{
    id: '卷积定理',
    content: '知识点名称：卷积定理。类型：知识点。它包含的子知识点有: 卷积计算方法。它的前导知识点有: 傅里叶变换性质、拉普拉斯变换性质、通信系统'
},
{
    id: '时域微分',
    content: '知识点名称：时域微分。类型：知识点。它包含的子知识点有: 电路系统复频域分析、零输入响应求解方法。它的前导知识点有: 傅里叶变换性质、拉普拉斯变换性质'
},
{
    id: '时域积分',
    content: '知识点名称：时域积分。类型：知识点。它包含的子知识点有: 电路系统复频域分析。它的前导知识点有: 傅里叶变换性质、拉普拉斯变换性质'
},
{
    id: '频域微分',
    content: '知识点名称：频域微分。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换性质'
},
{
    id: '频域积分',
    content: '知识点名称：频域积分。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换性质'
},
{
    id: '帕斯瓦尔定理',
    content: '知识点名称：帕斯瓦尔定理。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 傅里叶变换性质'
},
{
    id: '冲激串信号',
    content: '知识点名称：冲激串信号。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶变换'
},
{
    id: '周期脉冲信号',
    content: '知识点名称：周期脉冲信号。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶变换'
},
{
    id: '冲激信号组成频谱',
    content: '知识点名称：冲激信号组成频谱。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 周期信号傅里叶变换'
},
{
    id: '理想抽样',
    content: '知识点名称：理想抽样。类型：知识点。它包含的子知识点有: 冲激串信号傅里叶变换。它的前导知识点有: 抽样'
},
{
    id: '矩形脉冲抽样',
    content: '知识点名称：矩形脉冲抽样。类型：知识点。它包含的子知识点有: 周期脉冲信号傅里叶变换。它的前导知识点有: 抽样'
},
{
    id: '抽样定理',
    content: '知识点名称：抽样定理。类型：知识点。它包含的子知识点有: 奈奎斯特抽样频率、奈奎斯特抽样间隔、被抽样信号频率受限、周期信号傅里叶变换、相乘定理。它的前导知识点有: 抽样'
},
{
    id: '奈奎斯特抽样频率',
    content: '知识点名称：奈奎斯特抽样频率。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 抽样定理'
},
{
    id: '奈奎斯特抽样间隔',
    content: '知识点名称：奈奎斯特抽样间隔。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 抽样定理'
},
{
    id: '被抽样信号频率受限',
    content: '知识点名称：被抽样信号频率受限。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 抽样定理'
},
{
    id: '频域系统函数',
    content: '知识点名称：频域系统函数。类型：知识点。它包含的子知识点有: 幅频特性、相频特性。它的前导知识点有: 线性系统频域分析'
},
{
    id: '无失真系统',
    content: '知识点名称：无失真系统。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 线性系统频域分析'
},
{
    id: '滤波器',
    content: '知识点名称：滤波器。类型：知识点。它包含的子知识点有: 低通滤波器、高通滤波器、带通滤波器、带阻滤波器、电路系统。它的前导知识点有: 线性系统频域分析'
},
{
    id: '通信系统',
    content: '知识点名称：通信系统。类型：知识点。它包含的子知识点有: 调制、解调、卷积定理。它的前导知识点有: 线性系统频域分析'
},
{
    id: '电路系统频域分析',
    content: '知识点名称：电路系统频域分析。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 线性系统频域分析'
},
{
    id: '幅频特性',
    content: '知识点名称：幅频特性。类型：知识点。它包含的子知识点有: 幅度频谱、滤波器设计方法、频谱分析。它的前导知识点有: 频域系统函数'
},
{
    id: '相频特性',
    content: '知识点名称：相频特性。类型：知识点。它包含的子知识点有: 相位频谱、滤波器设计方法、频谱分析。它的前导知识点有: 频域系统函数'
},
{
    id: '低通滤波器',
    content: '知识点名称：低通滤波器。类型：知识点。它包含的子知识点有: 滤波器设计方法、解调方法。它的前导知识点有: 滤波器'
},
{
    id: '高通滤波器',
    content: '知识点名称：高通滤波器。类型：知识点。它包含的子知识点有: 滤波器设计方法。它的前导知识点有: 滤波器'
},
{
    id: '带通滤波器',
    content: '知识点名称：带通滤波器。类型：知识点。它包含的子知识点有: 滤波器设计方法。它的前导知识点有: 滤波器'
},
{
    id: '带阻滤波器',
    content: '知识点名称：带阻滤波器。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 滤波器'
},
{ id: '调制', content: '知识点名称：调制。类型：知识点。它包含的子知识点有: 调制方法。它的前导知识点有: 通信系统' },
{ id: '解调', content: '知识点名称：解调。类型：知识点。它包含的子知识点有: 解调方法。它的前导知识点有: 通信系统' },
{
    id: '单边变换',
    content: '知识点名称：单边变换。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 拉普拉斯变换'
},
{
    id: '收敛域',
    content: '知识点名称：收敛域。类型：知识点。它包含的子知识点有: 左边信号、右边信号、傅里叶变换存在条件。它的前导知识点有: 拉普拉斯变换'
},
{
    id: '拉普拉斯变换性质',
    content: '知识点名称：拉普拉斯变换性质。类型：知识点。它包含的子知识点有: 线性、尺度变换、时移特性、频移特性、时域微分、时域积分、卷积定理、s域微分、s域积分、初值定理、终值定理。它的前导知识 点有: 拉普拉斯变换'
},
{ id: '左边信号', content: '知识点名称：左边信号。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 收敛域' },
{ id: '右边信号', content: '知识点名称：右边信号。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 收敛域' },
{
    id: 's域微分',
    content: '知识点名称：s域微分。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 拉普拉斯变换性质'
},
{
    id: 's域积分',
    content: '知识点名称：s域积分。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 拉普拉斯变换性质'
},
{
    id: '初值定理',
    content: '知识点名称：初值定理。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 拉普拉斯变换性质'
},
{
    id: '终值定理',
    content: '知识点名称：终值定理。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 拉普拉斯变换性质'
},
{
    id: '电路复频域域分析',
    content: '知识点名称：电路复频域域分析。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 线性系统复频域分析'
},
{
    id: '零极点矢量',
    content: '知识点名称：零极点矢量。类型：知识点。它包含的子知识点有: 频谱分析。它的前导知识点有: 线性系统复频域分析'
},
{
    id: '零极点',
    content: '知识点名称：零极点。类型：知识点。它包含的子知识点有: 极点与自由响应关系、极点与系统稳定性关系、极点与系统特征频率关系、全通系统零极点分布、最小相移系统零极点分布。它的前导知识点有: 线性系统复频域分析'
},
{
    id: '零状态响应求解方法',
    content: '知识点名称：零状态响应求解方法。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 线性系统复频域分析'
},
{
    id: '频谱分析',
    content: '知识点名称：频谱分析。类型：分析方法。它包含的子知识点有: 线性系统频域分析。它的前导知识点有: 零极点矢量、幅频特性、相频特性'
},
{
    id: '极点与自由响应关系',
    content: '知识点名称：极点与自由响应关系。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 零极点'
},
{
    id: '极点与系统稳定性关系',
    content: '知识点名称：极点与系统稳定性关系。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 零极点'
},
{
    id: '极点与系统特征频率关系',
    content: '知识点名称：极点与系统特征频率关系。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 零极点'
},
{
    id: '全通系统零极点分布',
    content: '知识点名称：全通系统零极点分布。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 零极点'
},
{
    id: '最小相移系统零极点分布',
    content: '知识点名称：最小相移系统零极点分布。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 零极点'
},
{
    id: '冲激串信号傅里叶变换',
    content: '知识点名称：冲激串信号傅里叶变换。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 理想抽样'
},
{
    id: '周期脉冲信号傅里叶变换',
    content: '知识点名称：周期脉冲信号傅里叶变换。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 矩形脉冲抽样'
},
{ id: '电路系统', content: '知识点名称：电路系统。类型：知识点。它包含的子知识点有: 。它的前导知识点有: 滤波器' },
{
    id: '系统特征频率',
    content: '知识点名称：系统特征频率。类型：知识点。它包含的子知识点有: 零输入响应求解方法。它的前导知识点有: 自由响应'
},
{
    id: '卷积图解法',
    content: '知识点名称：卷积图解法。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 卷积计算方法、信号基本运算、阶跃信号、卷积计算公式'
},
{
    id: '卷积解析法',
    content: '知识点名称：卷积解析法。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 卷积计算方法、阶跃信号、卷积计算公式'
},
{
    id: '卷积性质法',
    content: '知识点名称：卷积性质法。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 卷积计算方法、卷积计算公式、卷积计算性质、与冲激信号及其各阶导数卷积、与阶跃信号卷积'
},
{
    id: '滤波器设计方法',
    content: '知识点名称：滤波器设计方法。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 幅频特性、相频特性、通频带、低通滤波器、高通滤波器、带通滤波器'
},
{
    id: '调制方法',
    content: '知识点名称：调制方法。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 调制、相乘定理'
},
{
    id: '解调方法',
    content: '知识点名称：解调方法。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 解调、相乘定理、低通滤波器'
},
{
    id: '电路系统分析方法',
    content: '知识点名称：电路系统分析方法。类型：分析方法。它包含的子知识点有: 。它的前导知识点有: 电路系统频域分析、电路系统复频域分析、RC电路、RL电路'
},
{
    id: '电路系统频域分析',
    content: '知识点名称：电路系统频域分析。类型：分析方法。它包含的子知识点有: 电路系统分析方法。它的前导知识点有: 相量分析法、频域域系统函数、傅里叶变换'
},
{
    id: '电路系统复频域分析',
    content: '知识点名称：电路系统复频域分析。类型：分析方法。它包含的子知识点有: 电路系统分析方法。它的前导知识点有: 时域微分、时域积分、复频域系统函数、零输入响应求解方法、零状态响应求解方法、 拉普拉斯变换'
},
{
    id: '零输入响应求解方法',
    content: '知识点名称：零输入响应求解方法。类型：分析方法。它包含的子知识点有: 电路系统复频域分析。它的前导知识点有: 系统特征频率、时域微分、拉普拉斯变换'
},
{
    id: '零状态响应求解方法',
    content: '知识点名称：零状态响应求解方法。类型：分析方法。它包含的子知识点有: 电路系统复频域分析。它的前导知识点有: 复频域系统函数、拉普拉斯变换'
},
{
    id: '通频带',
    content: '知识点名称：通频带。类型：知识点。它包含的子知识点有: 滤波器设计方法。它的前导知识点有: '
},
{
    id: 'RC电路',
    content: '知识点名称：RC电路。类型：知识点。它包含的子知识点有: 电路系统分析方法。它的前导知识点有: '
},
{
    id: 'RL电路',
    content: '知识点名称：RL电路。类型：知识点。它包含的子知识点有: 电路系统分析方法。它的前导知识点有: '
},
{
    id: '相量分析法',
    content: '知识点名称：相量分析法。类型：分析方法。它包含的子知识点有: 电路系统频域分析。它的前导知识点有: '
}]

module.exports = {
    graphList,
    graphNameList,
    fullData,
    aliyunData
}